content/techlog/2019-08-06-writing-a-good-status-update.md
+++
title = "Writing a good status update"
author = ["Vedang Manerikar"]
date = 2019-08-06T00:00:00+05:30
tags = ["project_management", "engineering_management"]
categories = ["organization"]
draft = false
toc = true
+++

We share written status updates within the team on a weekly basis (every Monday). I wrote this article to explain what these status updates should look like, and I think it's useful enough to publish publicly. Here goes:


## What is the purpose of status updates? {#what-is-the-purpose-of-status-updates}

-   Let **your manager** know what you have achieved last week.
-   Let **your co-workers** know what you have achieved this week.
-   **Reflect** on your progress and pace **yourself**.


## Properties of good status updates {#properties-of-good-status-updates}

-   **Short** and **meaningful**. (5 min reading time)
-   Communicate **work in the previous week**, **highlight progress**.
-   Communicate **plan for the next week**, **help make yourself efficient**.
-   Communicate **open questions** and **blockers**, **highlight areas where we need to help you**.


## Writing the status update {#writing-the-status-update}

-   We ask for status updates on every Monday. First thing Monday
    morning, spend time reviewing your last week and creating an update.
    Remember to review the status you had posted last week as well! You
    need to give updates about all of those tasks.


### Create sections for your updates {#create-sections-for-your-updates}

-   Use the following sections:
    -   What I did last week
    -   What I plan to do this week
    -   Questions / Blockers
-   This makes it **easy to parse** your update.


### Name the project you are currently working on {#name-the-project-you-are-currently-working-on}

-   Yes, your manager is supposed to know what you are working on. But
    you often do unplanned, extra tasks too. You help on other projects,
    handle production issues, discover interesting tidbits, get insights
    from analyzing logs. **Highlight all of these activities!**.
-   Help your manager by making it easy for them to compile project reports.
-   This makes your update very readable.


### Name the milestone of the project you are currently working on. {#name-the-milestone-of-the-project-you-are-currently-working-on-dot}

-   Helps when we have to take a call about cutting or increasing scope on a project.
-   Highlights and reinforces upcoming co-ordination points.


### Your status update should definitively answer the following questions: {#your-status-update-should-definitively-answer-the-following-questions}

-   What are you working on?
-   For each project that you are working on, where are you? What is the
    next date that you are committing to?
-   Are you on track for the current phase of the project or not? If
    not, what is the impact on the overall project?


### Example status update {#example-status-update}


#### What I did last week: {#what-i-did-last-week}

-   Completed final PRD review for **Project X**, no open questions at
    this point! :yay:. Project is **on track**!
-   Pushed a fix to **ABC Service** to production and closed **Jira Ticket
    Z**. Graphs show amazing reduction in network bandwidth! :epicwin:
    _link to graph or screenshot_.
-   Working on dev of **Project Y**. Project is **not on track** :sad_face:.
    We had communicated that dev will be complete by <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-08-02 Fri&gt;</span></span>
    but I will need 3 more days. This pushes the **new date to
    <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-08-07 Wed&gt;</span></span>** EOD.
-   Conducted the Enterprise initiative meeting, meeting notes are here:
    _link to meeting notes_.


#### What I plan to do this week: {#what-i-plan-to-do-this-week}

-   I will have the initial estimates for **Project X** by EOD
    <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-08-08 Thu&gt;</span></span>.
-   I will complete the Dev work on **Project Y** as mentioned above.
-   I will create a document about **DEF Topic** as we had discussed by
    EOD <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-08-09 Fri&gt;</span></span>.


#### Questions / Blockers: {#questions-blockers}

-   We need to sync up about ideas for implementing **Project X** before
    tomorrow EOD, but you don't have an empty meeting slot until
    day-after. What should we do?
-   I will inform **Frontend team-member** that **Project Y** integration
    testing cannot start tomorrow, instead it will start on
    <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-08-08 Thu&gt;</span></span>.


## What do you get from writing a good update? {#what-do-you-get-from-writing-a-good-update}

-   A **record of work for yourself**. This is invaluable come performance
    review time. You only have to read through 26 updates and you have a
    thorough summary.
-   **Help your manager** advocate for you during appraisals. You should
    care about your career more than anyone else.
-   **Help yourself**. Writing the update should **give you** a clear idea
    of your own progress and what you need to work on.


## Addendum: How did we get here? {#addendum-how-did-we-get-here}

We didn't directly start with written updates in our team. We've
gotten here after a number of different attempts which, with periodic
review, we rejected.


### The Daily Standup {#the-daily-standup}


### The Weekly Standup {#the-weekly-standup}
